


import re

# a = '{"省市": " ", "证书编号": "HB09-Da-2019J006", "企业名称": "十堰国康国人医药连锁有限公司白浪中路大药房", "经营地址": "null", "认证范围": ""asdas"", "发证日期": "2019-07-05", "证书有效期": "2024-07-04", "备注": "", "发证机构": "十堰市经济技术开发区食品药品监督管理局", "": ""}'
#
#
# c = re.findall('"认证范围": "(.*?)",',a)
# if len(c)>0:
#     b = c[0].replace('"','')



aa = '{"省市": "uihuihuo",' \
     ' "证书编号": "C-GXWZ15-0683",' \
     ' "企业名称": ""广西梧州市一洲大药房连锁有限公司梧州金康店",' \
     ' "经营地址": ""梧州市万秀区富民三路43-2、43-3、43-4、43-5号一层3号商铺"",' \
     ' "认证范围": "",' \
     ' "发证日期": "2019-10-24",' \
     ' "证书有效期": "2021-06-06",' \
     ' "备注": "",' \
     ' "发证机构": "梧州市行政审批局",' \
     ' "": ""}'
a = re.findall('"省市": "(.*?)"',aa )
a1 = re.findall('"证书编号": "(.*?)"',aa )
a2 = re.findall('"企业名称": "(.*?)",',aa )
a3 = re.findall('"经营地址": "(.*?)",',aa )
a4 = re.findall('"认证范围": "(.*?)"',aa )
a5 = re.findall('"发证日期": "(.*?)"',aa )
a6 = re.findall('"证书有效期": "(.*?)"',aa )
a7 = re.findall('"备注": "(.*?)"',aa )
a8 = re.findall('"发证机构": "(.*?)"',aa )

print(a)
print(a1)
print(a2)
print(a3)
print(a4)
print(a5)
print(a6)
print(a7)
print(a8)
