# _*_ coding:gbk _*_
import re


a='{"NAME":"批准文号","CONTENT":"国药准字H20084337"},' \
  '{"NAME":"产品名称","CONTENT":"乳酸钠林格注射液"},' \
  '{"NAME":"英文名称","CONTENT":"SODIUM LACTATE RINGER"S INJECTION"},' \
  '{"NAME":"商品名","CONTENT":""},' \
  '{"NAME":"剂型","CONTENT":"注射剂"},' \
  '{"NAME":"规格","CONTENT":"500ml"},' \
  '{"NAME":"上市许可持有人","CONTENT":""},' \
  '{"NAME":"生产单位","CONTENT":"杭州民生药业有限公司"},' \
  '{"NAME":"生产地址","CONTENT":"杭州余杭经济技术开发区临平大道36号"},' \
  '{"NAME":"产品类别","CONTENT":"化学药品"},' \
  '{"NAME":"批准日期","CONTENT":"2018-08-31"},' \
  '{"NAME":"原批准文号","CONTENT":""},' \
  '{"NAME":"药品本位码","CONTENT":"86904494002741"},' \
  '{"NAME":"药品本位码备注","CONTENT":""},' \
  '{"NAME":"注","CONTENT":"说明 ：<br>　　企业用户如对药品数据信息有疑问，请及时与我局信息中心数据整理组联系，来电前请备好相应的批件证明材料以备工作人员查询。电话：88331520（工作日）；企业用户也可通过发邮件与我们联系：邮件地址yaopinshuju@nmpaic.org.cn，邮件主题请注明“药品批件问题”，邮件正文中请准确填写以下全部信息：1.药品批准文号/注册证号；2.药品批件号；3.药品批件类型（注册批件、补充批件、包材注册证、药品标准颁布件、再注册批件、其他）；4.问题描述（500字以内）；5.企业名称（全称）；6.统一社会信用代码；7.联系人姓名；8.联系电话（手机和座机）；9.电子邮件。以上内容请勿直接以电子邮件附件形式发送。","DESCRIPTION":"说明 ：<br>　　企业用户如对药品数据信息有疑问，请及时与我局信息中心数据整理组联系，来电前请备好相应的批件证明材料以备工作人员查询。电话：88331520（工作日）；企业用户也可通过发邮件与我们联系：邮件地址yaopinshuju@nmpaic.org.cn，邮件主题请注明“药品批件问题”，邮件正文中请准确填写以下全部信息：1.药品批准文号/注册证号；2.药品批件号；3.药品批件类型（注册批件、补充批件、包材注册证、药品标准颁布件、再注册批件、其他）；4.问题描述（500字以内）；5.企业名称（全称）；6.统一社会信用代码；7.联系人姓名；8.联系电话（手机和座机）；9.电子邮件。以上内容请勿直接以电子邮件附件形式发送。"}'



aa = a.replace('},','},|')
c=aa.split('|')
for i in c:
    try:
        b = eval(i)
        print(b)
    except Exception as e:
        name =re.findall('{"NAME":"(.*?)"',i)
        concent =re.findall('"CONTENT":"(.*)"',i)
        continue
